[IOs.M020_Talon_IO InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[ItemDefs.ID_EllieTool MissionItemDefinition]
UseFailureCharacterMessage="need %s for this project."
ItemName="Sir. There is a bottle"
PickupMessage="He was there %s"
UseFailureLevelMessage="You need %d level to use this feature."
UseFailureConstraintsMessage="You cannot use this item.."
NoManufacturerName="In general"

[ItemDefs.ID_EllieTool:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="A simple stroke can create magic."
NoConstraintText=""
Suffix=""
Prefix=""

[ItemDefs.ID_SkagTongue MissionItemDefinition]
UseFailureCharacterMessage="job %s This thing."
ItemName="ugly dictionary"
PickupMessage="you understand %s"
UseFailureLevelMessage="This feature requires at least %d."
UseFailureConstraintsMessage="You can't use it."
NoManufacturerName="general"

[ItemDefs.ID_SkagTongue:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="This is called a plan. Not yet though. There's a place.."
NoConstraintText=""
Suffix=""
Prefix=""

[M_Anemone_PlotMission025 MissionDefinition]
MissionName="People work for this"
MissionDescription="Mordecai and his companions may have tried to return to the Talon Temple, but from the Scarab Hill they saw waves of new Pandoran soldiers heading in the direction of the City of Fire. To save her, award asked Eli to help her repair the garden.."
TurnInDescription="Mordecai is infected and only Cassius can cure him. God bless you.."
MissionSummary="Management of camps."
MissionGiver="leave"
MissionTurnInLocation="Lilith"
TeaserText=""

[M_Anemone_PlotMission025:ClearMordecaiLair MissionObjectiveDefinition]
ProgressMessage="Do not stay in Mordechai's house"

[M_Anemone_PlotMission025:DefendBackburner MissionObjectiveDefinition]
ProgressMessage="Always come back"

[M_Anemone_PlotMission025:EnterMine MissionObjectiveDefinition]
ProgressMessage="Enter the Moon Mine"

[M_Anemone_PlotMission025:FindMordecai MissionObjectiveDefinition]
ProgressMessage="Look at Mororekai near Mount Harafuhit"

[M_Anemone_PlotMission025:FixTurrets MissionObjectiveDefinition]
ProgressMessage="repair the tower"

[M_Anemone_PlotMission025:FollowClues MissionObjectiveDefinition]
ProgressMessage="Follow Talon and follow his features."

[M_Anemone_PlotMission025:HeadToTheMine MissionObjectiveDefinition]
ProgressMessage="go to the old man in my valley"

[M_Anemone_PlotMission025:KillChosen MissionObjectiveDefinition]
ProgressMessage="Destroy Neopandora"

[M_Anemone_PlotMission025:OpenCamp MissionObjectiveDefinition]
ProgressMessage="Entering the camp"

[M_Anemone_PlotMission025:RendezVousMordecai MissionObjectiveDefinition]
ProgressMessage="Meet Mordecai"

[M_Anemone_PlotMission025:ReturnToBackburner MissionObjectiveDefinition]
ProgressMessage="Return to the fire."

[M_Anemone_PlotMission025:ReviveMordecaiEnd MissionObjectiveDefinition]
ProgressMessage="Mordechai restored it"

[M_Anemone_PlotMission025:Set_ClearMordecaiLair MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_PlotMission025:Set_DefendBackburner MissionObjectiveSetDefinition]
MissionSummaryOverride="Protect the camp."
MissionDescriptionOverride=""

[M_Anemone_PlotMission025:Set_EnterTheMine MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_PlotMission025:Set_FindMordecai MissionObjectiveSetDefinition]
MissionSummaryOverride="Meet Mordecai."
MissionDescriptionOverride="After fighting the new Bandori and saving the park, Danis admits that he can't cure the disease. However, Cassius Lechlermann, the former Atlas scientist who discovered the gas, was unaware that Hector planned to plant it on Earth. Cassius ordered him to be treated in the secret chamber.."

[M_Anemone_PlotMission025:Set_FindMordecai002 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_PlotMission025:Set_FindMordecai003 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_PlotMission025:Set_FixTurrets MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_PlotMission025:Set_FollowClues MissionObjectiveSetDefinition]
MissionSummaryOverride="Call Mordechai."
MissionDescriptionOverride=""

[M_Anemone_PlotMission025:Set_FollowClues002 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_PlotMission025:Set_FollowClues003 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_PlotMission025:Set_HeadToMine MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_PlotMission025:Set_HeadToTheMine MissionObjectiveSetBranchingDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_PlotMission025:Set_KillChosen MissionObjectiveSetDefinition]
MissionSummaryOverride="Salvation of Mordecai."
MissionDescriptionOverride="You will meet Mordecai together with Talon on the way to Cassius's laboratory, you arrive just in time to help Mordecai escape from the Neo-Pandorians. But not before he injected the mutant gas. After a while it became a tree with two branches. We need Cassius' medicine now more than ever.."

[M_Anemone_PlotMission025:Set_ReturnToBackburner MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_PlotMission025:Set_ReviveMordecaiEnd MissionObjectiveSetDefinition]
MissionSummaryOverride="kind Mordecai."
MissionDescriptionOverride=""

[M_Anemone_PlotMission025:Set_TakeTool MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_PlotMission025:TakeTool MissionObjectiveDefinition]
ProgressMessage="press the button"

